In [1]:
import pandas as pd
import numpy as np

# 1

In [2]:
df1 = pd.DataFrame({'Company_A':[12,24,34,43,np.NaN],
                   'Company_B':[13,np.NaN,16,54,np.NaN],
                   'Company_C':[np.NaN,10,17,np.NaN,3]})

In [3]:
df1

   Company_A  Company_B  Company_C
0       12.0       13.0        NaN
1       24.0        NaN       10.0
2       34.0       16.0       17.0
3       43.0       54.0        NaN
4        NaN        NaN        3.0

In [4]:
df1=df1.fillna(0)

In [5]:
df1.index=range(2008,2017,2)
print(df1)

      Company_A  Company_B  Company_C
2008       12.0       13.0        0.0
2010       24.0        0.0       10.0
2012       34.0       16.0       17.0
2014       43.0       54.0        0.0
2016        0.0        0.0        3.0

# 2

In [6]:
df = pd.DataFrame({ 'Col1' : [1,np.NaN,3,np.NaN],
                   'Col2' : [8,9,7,10]})

In [7]:
def impute(df):
    if (np.mean(df.Col2) > 5):
        df = df.fillna(np.mean(df.Col2))
    else:
        df = df.fillna(0)
    return df

In [8]:
impute(df)

   Col1  Col2
0   1.0     8
1   8.5     9
2   3.0     7
3   8.5    10

# 3

In [9]:
roedata = pd.read_csv('roedata.csv')
import re

In [10]:
roedata[10:21]

                     Industry Name  Number of firms      ROE
10                   Biotechnology              349    6.77%
11                    Broadcasting               30   74.10%
12  Brokerage & Investment Banking               49    9.25%
13              Building Materials               37    6.78%
14    Business & Consumer Services              179   12.48%
15                        Cable TV               16   26.62%
16                Chemical (Basic)               47    8.80%
17          Chemical (Diversified)               10   24.33%
18            Chemical (Specialty)              100   22.10%
19           Coal & Related Energy               45  -14.66%
20               Computer Services              129   39.46%

In [11]:
roedata['ROE'] = roedata['ROE'].apply(lambda x: re.sub(r'\-+\d*\.\d*\%','0',x))

In [12]:
roedata[10:21]

                     Industry Name  Number of firms     ROE
10                   Biotechnology              349   6.77%
11                    Broadcasting               30  74.10%
12  Brokerage & Investment Banking               49   9.25%
13              Building Materials               37   6.78%
14    Business & Consumer Services              179  12.48%
15                        Cable TV               16  26.62%
16                Chemical (Basic)               47   8.80%
17          Chemical (Diversified)               10  24.33%
18            Chemical (Specialty)              100  22.10%
19           Coal & Related Energy               45       0
20               Computer Services              129  39.46%

# 4

In [13]:
df4 = pd.DataFrame({'first_name': ['Jason',np.NaN,'Tina','Jake','Amy'],
                   'last_name': ['Miller',np.NaN,'Ali','Milner','Cooze'],
                   'age': [42,np.NaN,36,24,73],
                   'sex': ['m',np.NaN,'f','m','f'],
                   'preTestScore': [4,3,3,2,3],
                   'postTestScore': [25,np.NaN,70,62,70],
                   'location': [np.NaN,np.NaN,np.NaN,np.NaN,np.NaN]
                    })

In [14]:
df4

    age first_name last_name  location  postTestScore  preTestScore  sex
0  42.0      Jason    Miller       NaN           25.0             4    m
1   NaN        NaN       NaN       NaN            NaN             3  NaN
2  36.0       Tina       Ali       NaN           70.0             3    f
3  24.0       Jake    Milner       NaN           62.0             2    m
4  73.0        Amy     Cooze       NaN           70.0             3    f

In [15]:
df4.age=df4.age.fillna(np.mean(df4.age))

In [16]:
df4

     age first_name last_name  location  postTestScore  preTestScore  sex
0  42.00      Jason    Miller       NaN           25.0             4    m
1  43.75        NaN       NaN       NaN            NaN             3  NaN
2  36.00       Tina       Ali       NaN           70.0             3    f
3  24.00       Jake    Milner       NaN           62.0             2    m
4  73.00        Amy     Cooze       NaN           70.0             3    f

In [17]:
df4[['first_name','last_name']]=df4[['first_name','last_name']].fillna("XYZ")

In [18]:
df4.sex=df4.sex.fillna(df4.sex.value_counts().idxmax()) #filling with most frequently occuring gender

In [19]:
df4

     age first_name last_name  location  postTestScore  preTestScore sex
0  42.00      Jason    Miller       NaN           25.0             4   m
1  43.75        XYZ       XYZ       NaN            NaN             3   f
2  36.00       Tina       Ali       NaN           70.0             3   f
3  24.00       Jake    Milner       NaN           62.0             2   m
4  73.00        Amy     Cooze       NaN           70.0             3   f

In [20]:
df4.postTestScore=df4.postTestScore.fillna(df4.groupby("sex")["postTestScore"].transform("mean"))
df4

     age first_name last_name  location  postTestScore  preTestScore sex
0  42.00      Jason    Miller       NaN           25.0             4   m
1  43.75        XYZ       XYZ       NaN           70.0             3   f
2  36.00       Tina       Ali       NaN           70.0             3   f
3  24.00       Jake    Milner       NaN           62.0             2   m
4  73.00        Amy     Cooze       NaN           70.0             3   f

# 5

In [21]:
df5 = pd.DataFrame([[np.NaN,2],[3,np.NaN]])
df6 = pd.DataFrame([[10,11],[12,13]])

In [22]:
print(df5)
print(df6)

     0    1
0  NaN  2.0
1  3.0  NaN
    0   1
0  10  11
1  12  13

In [23]:
df5.fillna(df6)

      0     1
0  10.0   2.0
1   3.0  13.0